# Exploratory data analysis

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Get dataframes from csvs
artist = pd.read_csv("artist.csv")
work = pd.read_csv("work.csv")
subject = pd.read_csv("subject.csv")
museum = pd.read_csv("museum.csv")
museum_hours = pd.read_csv("museum_hours.csv")
product_size = pd.read_csv("product_size.csv")
canvas_size = pd.read_csv("canvas_size.csv")

## Primary key
Checking the primary key for each data set. What is the primary key's data type? Is it unique? Are there any null values?

Checking **artist** DataFrame:

In [3]:
artist["artist_id"]

0      500
1      501
2      502
3      503
4      504
      ...
416    916
417    917
418    918
419    919
420    920
Name: artist_id, Length: 421, dtype: int64

In [4]:
print(f"Actual count: {artist['artist_id'].count()}") 
print(f"Expected count: {artist['artist_id'].drop_duplicates().count()}")

Actual count: 421
Expected count: 421

In [5]:
artist[artist["artist_id"].isnull()].count()

artist_id       0
full_name       0
first_name      0
middle_names    0
last_name       0
nationality     0
style           0
birth           0
death           0
dtype: int64

Checking **work** DataFrame:

In [6]:
work["work_id"]

0        160228
1        160236
2        160244
3        160252
4        160260
          ...
14771      8279
14772      8283
14773      8285
14774    184820
14775    184829
Name: work_id, Length: 14776, dtype: int64

In [7]:
print(f"Actual count: {work['work_id'].count()}") 
print(f"Expected count: {work['work_id'].drop_duplicates().count()}")

Actual count: 14776
Expected count: 14716

In [8]:
work[work['work_id'].isnull()].count()

work_id      0
name         0
artist_id    0
style        0
museum_id    0
dtype: int64

Checking **museum** DataFrame:

In [9]:
museum['museum_id']

0     30
1     31
2     32
3     33
4     34
5     35
6     36
7     37
8     38
9     39
10    40
11    41
12    42
13    43
14    44
15    45
16    46
17    47
18    48
19    49
20    50
21    51
22    52
23    53
24    54
25    55
26    56
27    57
28    58
29    59
30    60
31    61
32    62
33    63
34    64
35    65
36    66
37    67
38    68
39    69
40    70
41    71
42    72
43    73
44    74
45    75
46    76
47    77
48    78
49    79
50    80
51    81
52    82
53    83
54    84
55    85
56    86
Name: museum_id, dtype: int64

In [10]:
print(f"Actual count: {museum['museum_id'].count()}") 
print(f"Expected count: {museum['museum_id'].drop_duplicates().count()}")

Actual count: 57
Expected count: 57

In [11]:
museum[museum['museum_id'].isnull()].count()

museum_id    0
name         0
address      0
city         0
state        0
postal       0
country      0
phone        0
url          0
dtype: int64

Checking **canvas_size** DataFrame:

In [12]:
canvas_size['size_id']

0        20
1        24
2        30
3        36
4        40
       ...
195    7963
196    8040
197    8051
198    8959
199    9648
Name: size_id, Length: 200, dtype: int64

In [13]:
print(f"Actual count: {canvas_size['size_id'].count()}") 
print(f"Expected count: {canvas_size['size_id'].drop_duplicates().count()}")

Actual count: 200
Expected count: 200

In [14]:
canvas_size[canvas_size['size_id'].isnull()].count()

size_id    0
width      0
height     0
label      0
dtype: int64

Checking **product_size** DataFrame:

In [15]:
product_size['work_id'], product_size['size_id']

(0         160228
 1         160228
 2         160236
 3         160236
 4         160244
            ...
 110342    184829
 110343    184829
 110344    184829
 110345    184829
 110346    184829
 Name: work_id, Length: 110347, dtype: int64,
 0           24
 1           30
 2           24
 3           30
 4           24
           ...
 110342    3030
 110343    3636
 110344    4040
 110345    4848
 110346    6060
 Name: size_id, Length: 110347, dtype: object)

In [16]:
product_size[product_size["size_id"].str.contains(r"\.") == True], product_size[product_size["size_id"].str.contains(r"\.") == False]

(        work_id size_id  sale_price  regular_price
 3858       6933  16.223         255            425
 3888       6937  28.836         335            585
 4424      25597  39.532         375            675
 7091       6024  3628.7         335            595
 7141       6034  32.226         285            495
 ...         ...     ...         ...            ...
 107508      889  26.332         285            485
 107538      892  2936.6         335            585
 107722      945  3628.5         335            585
 107790      957  35.628         335            585
 107823      960  3628.6         335            585

 [116 rows x 4 columns],
         work_id size_id  sale_price  regular_price
 0        160228      24          85             85
 1        160228      30          95             95
 2        160236      24          85             85
 3        160236      30          95             95
 4        160244      24          85             85
 ...         ...     ...         ...            ...
 110342   184829    3030         335            595
 110343   184829    3636         395            715
 110344   184829    4040         455            835
 110345   184829    4848         565           1055
 110346   184829    6060         775           1475

 [110231 rows x 4 columns])

There are **116 decimal-valued size_ids** in product_size

In [17]:
canvas_size

     size_id  width  height                       label
0         20     20     NaN               20" Long Edge
1         24     24     NaN               24" Long Edge
2         30     30     NaN               30" Long Edge
3         36     36     NaN               36" Long Edge
4         40     40     NaN               40" Long Edge
..       ...    ...     ...                         ...
195     7963     79    63.0  79" x 63"(201 cm x 160 cm)
196     8040     80    40.0  80" x 40"(203 cm x 102 cm)
197     8051     80    51.0  80" x 51"(203 cm x 130 cm)
198     8959     89    59.0  89" x 59"(226 cm x 150 cm)
199     9648     96    48.0  96" x 48"(244 cm x 122 cm)

[200 rows x 4 columns]

**NOTE:** size_id encodes the dimensions of a canvas.

In [18]:
print(f"Actual count: {product_size[['work_id','size_id']].count()}") 
print(f"Expected count: {product_size[['work_id','size_id']].drop_duplicates(subset=['work_id','size_id']).count()}")

Actual count: work_id    110347
size_id    110347
dtype: int64
Expected count: work_id    109660
size_id    109660
dtype: int64

In [19]:
print(f"Row count: {product_size.count()}") 
print(f"Deduplicated count: {product_size.drop_duplicates().count()}")

Row count: work_id          110347
size_id          110347
sale_price       110347
regular_price    110347
dtype: int64
Deduplicated count: work_id          109660
size_id          109660
sale_price       109660
regular_price    109660
dtype: int64

In [20]:
product_size[product_size["size_id"].str.contains(r"#VALUE!") == True]

        work_id  size_id  sale_price  regular_price
2452     208485  #VALUE!         225            375
7060       6018  #VALUE!         295            515
7177       6044  #VALUE!         265            455
7288       6068  #VALUE!         265            455
7571     128845  #VALUE!         505            895
...         ...      ...         ...            ...
107578      897  #VALUE!         335            585
107714      944  #VALUE!         335            585
107762      953  #VALUE!         335            585
107772      955  #VALUE!         275            465
107777      956  #VALUE!         335            585

[212 rows x 4 columns]

There are **212 '#VALUE!' size_ids** in product_size.

Checking **museum_hours** DataFrame:

In [21]:
museum_hours['museum_id'], museum_hours['day']

(0      30
 1      30
 2      30
 3      30
 4      30
        ..
 346    86
 347    86
 348    86
 349    86
 350    86
 Name: museum_id, Length: 351, dtype: int64,
 0         Sunday
 1         Monday
 2        Tuesday
 3      Wednesday
 4        Thusday
          ...
 346      Tuesday
 347    Wednesday
 348     Thursday
 349       Friday
 350     Saturday
 Name: day, Length: 351, dtype: object)

In [22]:
museum_hours['day'].unique()

array(['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thusday', 'Friday',
       'Saturday', 'Thursday'], dtype=object)

In [23]:
print(f"Actual count: {museum_hours[['museum_id','day']].count()}") 
print(f"Expected count: {museum_hours[['museum_id','day']].drop_duplicates().count()}")

Actual count: museum_id    351
day          351
dtype: int64
Expected count: museum_id    350
day          350
dtype: int64

In [24]:
print(f"Row count: {museum_hours.count()}") 
print(f"Deduplicated count: {museum_hours.drop_duplicates().count()}")

Row count: museum_id    351
day          351
open         351
close        351
dtype: int64
Deduplicated count: museum_id    350
day          350
open         350
close        350
dtype: int64

Checking **subject** DataFrame:

In [25]:
subject['work_id'], subject['subject']

(0       160228
 1       160236
 2       160244
 3       160252
 4       160260
          ...
 6766      8145
 6767      8171
 6768      8179
 6769      8183
 6770      8269
 Name: work_id, Length: 6771, dtype: int64,
 0         Still-Life
 1         Still-Life
 2         Still-Life
 3         Still-Life
 4         Still-Life
             ...
 6766       Portraits
 6767    Rivers/Lakes
 6768          Summer
 6769       Seascapes
 6770       Seascapes
 Name: subject, Length: 6771, dtype: object)

In [26]:
subject[subject['work_id'].isnull()].count(), subject[subject['subject'].isnull()].count()

(work_id    0
 subject    0
 dtype: int64,
 work_id    0
 subject    0
 dtype: int64)

In [27]:
print(f"Actual count: {subject[['work_id','subject']].count()}") 
print(f"Expected count: {subject[['work_id','subject']].drop_duplicates().count()}")

Actual count: work_id    6771
subject    6771
dtype: int64
Expected count: work_id    6712
subject    6712
dtype: int64

In [28]:
print(f"Row count: {subject.count()}") 
print(f"Deduplicated count: {subject.drop_duplicates().count()}")

Row count: work_id    6771
subject    6771
dtype: int64
Deduplicated count: work_id    6712
subject    6712
dtype: int64

## Foreign Keys and relationships
Checking foreign keys and the relationships between tables.

Checking the **work** and **museum** tables:

In [29]:
null_or_invalid_museum_ids = work[~work['museum_id'].isin(museum['museum_id'])]
null_or_invalid_museum_ids

,work_id,name,artist_id,style,museum_id
6,125752,Arabian Horses at Pasture,757,Baroque,NaN
7,125818,Count Halm on His Basedow Estate,757,Baroque,NaN
9,125763,Napoleon Before the Burning City of Smolensk,757,Baroque,NaN
10,125774,Peasants Resting in the Field,757,Baroque,NaN
11,125785,Portrait Oberleutnant Theodor Von Klein,757,Baroque,NaN
...,...,...,...,...,...
14768,8273,Waiting for an Answer,794,American Art,NaN
14772,8283,"West Point, Prout's Neck",794,American Art,NaN
14773,8285,Winding Line,794,American Art,NaN
14774,184820,Untitled,620,Surrealism,NaN
14775,184829,Untitled,620,Surrealism,NaN

In [30]:
null_or_invalid_museum_ids['museum_id'].unique()

array([nan])

There are **10223 null museum_ids** in work. The museums that these works belong to are 'Unknown'.

In [31]:
unassociated_museum_ids = museum[~museum['museum_id'].isin(work['museum_id'])]
unassociated_museum_ids

Empty DataFrame
Columns: [museum_id, name, address, city, state, postal, country, phone, url]
Index: []

Checking the **work** and **artist** tables:

In [32]:
null_or_invalid_artist_ids = work[~work['artist_id'].isin(artist['artist_id'])]
null_or_invalid_artist_ids

Empty DataFrame
Columns: [work_id, name, artist_id, style, museum_id]
Index: []

In [33]:
unassociated_artist_ids = artist[~artist['artist_id'].isin(work['artist_id'])]
unassociated_artist_ids

Empty DataFrame
Columns: [artist_id, full_name, first_name, middle_names, last_name, nationality, style, birth, death]
Index: []

Checking **subject** and **work** tables:

In [34]:
null_or_invalid_work_ids = subject[~subject['work_id'].isin(work['work_id'])]
null_or_invalid_work_ids

Empty DataFrame
Columns: [work_id, subject]
Index: []

In [35]:
unassociated_work_ids = work[~work['work_id'].isin(subject['work_id'])]
unassociated_work_ids

,work_id,name,artist_id,style,museum_id
7,125818,Count Halm on His Basedow Estate,757,Baroque,NaN
10,125774,Peasants Resting in the Field,757,Baroque,NaN
11,125785,Portrait Oberleutnant Theodor Von Klein,757,Baroque,NaN
12,125796,The Rescue of Count Munnich,757,Baroque,NaN
13,125807,The Stable Yard,757,Baroque,NaN
...,...,...,...,...,...
14771,8279,Weaning the Calf,794,American Art,35.0
14772,8283,"West Point, Prout's Neck",794,American Art,NaN
14773,8285,Winding Line,794,American Art,NaN
14774,184820,Untitled,620,Surrealism,NaN
14775,184829,Untitled,620,Surrealism,NaN

There are **8709 work_ids not referenced in work** by the foreign key work_id in subject.

Checking **museum_hours** and **museum** table:

In [36]:
null_or_invalid_museum_ids = museum_hours[~museum_hours['museum_id'].isin(museum['museum_id'])]
null_or_invalid_museum_ids

Empty DataFrame
Columns: [museum_id, day, open, close]
Index: []

In [37]:
unassociated_museum_ids = museum[~museum['museum_id'].isin(museum_hours['museum_id'])]
unassociated_museum_ids

Empty DataFrame
Columns: [museum_id, name, address, city, state, postal, country, phone, url]
Index: []

Checking **product_size** and **work** table:

In [38]:
null_or_invalid_work_ids = product_size[~product_size['work_id'].isin(work['work_id'])]
null_or_invalid_work_ids

Empty DataFrame
Columns: [work_id, size_id, sale_price, regular_price]
Index: []

In [39]:
unassociated_work_ids = work[~work['work_id'].isin(product_size['work_id'])]
unassociated_work_ids

,work_id,name,artist_id,style,museum_id
853,27187,The Mother and Sister of the Artist,769,Impressionism,46.0
988,192414,A Blustery Winter Day,636,NaN,NaN
1367,192390,"Grainstacks at the End of Summer, Morning Effect",550,NaN,NaN
1961,27686,Dancing Girls in Colourful Rays,824,Expressionism,NaN
4611,192400,Black Bashi Bazouk,667,NaN,NaN
...,...,...,...,...,...
14217,192403,"Olive Orchard (30"" x 24"")",677,NaN,NaN
14295,192376,"Starry Night (30"" x 24"")",677,NaN,NaN
14309,192411,"Sunflowers, 12 in a Vase (26"" x 32"")",677,NaN,NaN
14311,192412,"Sunflowers, 14 in a Vase (24"" x 30"")",677,NaN,NaN
14314,192410,"Sunflowers (24"" x 30"")",677,NaN,NaN

There are **86 work_ids not referenced in work** by the foreign key work_id in product_size.

Checking **product_size** and **canvas_size** table:

In [40]:
# Convert invalid size ids
product_size["size_id"] = product_size["size_id"].replace("#VALUE!", 0).astype("str")

# Convert decimal valued size ids
product_size["size_id"] = (
    np.where(
        product_size["size_id"].str.contains(r"\d+\.\d+"),
        (product_size["size_id"].astype("float64") * 1000).astype(str),
        product_size["size_id"],
    )
    .astype("float64")
    .astype("int64")
)

In [41]:
null_or_invalid_size_ids = product_size[~product_size['size_id'].isin(canvas_size['size_id'])]
null_or_invalid_size_ids

        work_id  size_id  sale_price  regular_price
2452     208485        0         225            375
3858       6933    16222         255            425
3888       6937    28836         335            585
4424      25597    39532         375            675
7060       6018        0         295            515
...         ...      ...         ...            ...
107762      953        0         335            585
107772      955        0         275            465
107777      956        0         335            585
107790      957    35628         335            585
107823      960  3628600         335            585

[328 rows x 4 columns]

In [42]:
null_or_invalid_size_ids['size_id'].unique()

array([      0,   16222,   28836,   39532, 3628700,   32226, 3225500,
         32426, 3239800, 2936500, 3225600, 3223700,   36329,   36432,
         36532,   27326,   31944,   28525,   57745, 3225900, 2417800,
       5136500, 5439400,   22430,   26232,   50635,   39632, 3225800,
         35652, 4235500, 5062600, 2823200, 2419700,   25632,   37428,
       2921700, 2921500, 2639800,   32250,   31525, 5936200, 2923600,
       2923700,   25732, 2632100,   57542, 3536500,   38531, 5691200,
       3225700,   32326,   39526,   23529, 4023700,   36429,   36326,
         36829,   32524,   36529,   39435,   79163,   36626, 3239400,
         39429, 5844900, 3239200,   57545,   25832,   32332,   28824,
       3628600, 4635400, 2632300,   50465, 4835800,   19524,   28936,
       3628500,   44534, 3628800,   45835,   28537,   32125,   28724,
       3729300,   37530,   29137, 3527600, 2227200, 3123600, 3729900,
         26332, 2936600,   35628], dtype=int64)

There are **328 invalid size_ids** in product_size, which correspond to the decimal and '#VALUES' valued ids seen above.

In [43]:
unassociated_size_ids = canvas_size[~canvas_size['size_id'].isin(product_size['size_id'])]
unassociated_size_ids

     size_id  width  height                       label
7       1522     15    22.0    15" x 22"(38 cm x 56 cm)
8       1618     16    18.0    16" x 18"(41 cm x 46 cm)
10      1623     16    23.0    16" x 23"(41 cm x 58 cm)
13      1826     18    26.0    18" x 26"(46 cm x 66 cm)
14      1926     19    26.0    19" x 26"(48 cm x 66 cm)
..       ...    ...     ...                         ...
193     7940     79    40.0  79" x 40"(201 cm x 102 cm)
194     7955     79    55.0  79" x 55"(201 cm x 140 cm)
195     7963     79    63.0  79" x 63"(201 cm x 160 cm)
197     8051     80    51.0  80" x 51"(203 cm x 130 cm)
198     8959     89    59.0  89" x 59"(226 cm x 150 cm)

[130 rows x 4 columns]

There are **130 size_ids not referenced in canvas_size** by the foreign key size_id in product_size.